//****************************************************************************
//****************************************************************************
//**                                                                        **
//**            (C)Copyright 1993-2017 Supermicro Computer, Inc.            **
//**                                                                        **
//****************************************************************************
//****************************************************************************
//
//  File History
//
//  Rev. 1.02
//    Bug Fix : Based upon "Purley_Setup_Mapping_Language_Draft_20170413_Joe.xlsx" 
//              and "X11_Purley_BIOS_Setup_Template_With_Mapping_Language_Draft_20170413_Joe.xlsx" 
//              to distinguish between "STR_SMC_ONBOARD_LAN_1_SELECT" and "STR_SMC_ONBOARD_LAN_1_10G_SELECT".
//    Reason  : Bug Fixed
//    Auditor : Joe Jhang
//    Date    : Apr/13/2017
//
//  Rev. 1.01
//    Bug Fix : N/A.
//    Reason  : Based on Purley_Setup_Mapping_Language_Draft_20170301_Joe.xlsx 
//              and Official_BIOS_SOP_Revised_Draft_20170301_Mapping_Language_Joe.xlsx 
//              to implement HII mapping language for BIOS setting preservation.
//    Auditor : Joe Jhang
//    Date    : Mar/02/2017
//  
//  Rev. 1.00
//    Bug Fix:  Initialize revision
//    Reason:   Get base code from Grantley
//    Auditor:  Kasber Chen
//    Date:     Jun/07/2016
//
//****************************************************************************
//****************************************************************************
﻿﻿﻿﻿﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//
// @file ServerMgmtSetupStrings.uni
//
//  String definitions for the Server Management screen
//


//#include "VFR.uni"
#langdef   en-US "English"    // English
#langdef   x-AMI "x-AMI"    // AMI Mapping Language

#string STR_EMPTY                           #language en-US ""

#string STR_ENABLED                         #language en-US "Enabled"
#string STR_DISABLED                        #language en-US "Disabled"
#string STR_NONE                            #language en-US "None"
#string STR_AUTO                            #language en-US "Auto"

#string STR_SERVER_MGMT_TITLE               #language en-US "IPMI"  // SMCPKG_SUPPORT
#string STR_SERVER_MGMT_TITLE_HELP          #language en-US "Press <Enter> to view or change the Server management configuration."

#string STR_ENABLING_DISABLING_OPTIONS      #language en-US "Enabling/Disabling Options"
#string STR_BMC_SUPPORT                     #language en-US "BMC Support"
                                            #language x-AMI "IPMI600"
#string STR_BMC_SUPPORT_HELP                #language en-US "Enable/Disable interfaces to communicate with BMC"
#string STR_ERROR_SIMULATION_FORM_TITLE     #language en-US "Error Simulation"
#string STR_ERROR_SIMULATION_FORM_HELP      #language en-US "Simulate Various POST Errors"
#string STR_WAIT_FOR_BMC_RESPONSE           #language en-US "Wait For BMC"
                                            #language x-AMI  "IPMI601"
#string STR_WAIT_FOR_BMC_RESPONSE_HELP      #language en-US "Wait For BMC response for specified time out. In PILOTII, BMC starts at the same time when BIOS starts during AC power ON. It takes around 30 seconds to initialize Host to BMC interfaces."
#string STR_IPMI_BMC_SELF_TEST_STATUS       #language en-US "IPMI STATUS"	// SMCPKG_SUPPORT
#string STR_IPMI_BMC_SELF_TEST_STATUS_VAL   #language en-US ""
#string STR_IPMI_BMC_SELF_TEST_STATUS_HELP  #language en-US "Displays current BMC Self Test Whether PASSED or FAILED.In FAILED case, please check Bmc Self Test Log page for error reported"

#string STR_BMC_TIME_ZONE                   #language en-US "Time Zone(UTC Offset)"
                                            #language x-AMI "IPMI602"
#string STR_BMC_TIME_ZONE_HELP              #language en-US "Enter UTC Offset in hours i.e. from -24:00 to +24:00. These values will be converted into minutes and programmed to BMC. Enter 0x7FFF to consider BIOS time as local time"
#string STR_BMC_CURR_TIME_ZONE_HELP         #language en-US "Display Current BMC Time Zone value. Unspecified displayed for 0x07FF value in BMC "
#string STR_BMC_CURR_TIME_ZONE              #language en-US "Current Time Zone"
#string STR_BMC_CURR_TIME_ZONE_VALUE        #language en-US "Unspecified"

#string STR_BMC_TIME_ZONE_DEFAULT           #language en-US "0x7FFF"

#string STR_IPMI_BMC_DEVICE_ID_HELP         #language en-US "Displays BMC Device ID"
#string STR_IPMI_BMC_DEVICE_ID              #language en-US "BMC Device ID"
#string STR_IPMI_BMC_DEVICE_ID_VAL          #language en-US "Unknown"

#string STR_IPMI_BMC_DEVICE_REVISION_HELP   #language en-US "Displays BMC Device Revision"
#string STR_IPMI_BMC_DEVICE_REVISION        #language en-US "BMC Device Revision"
#string STR_IPMI_BMC_DEVICE_REVISION_VAL    #language en-US "Unknown"

#string STR_IPMI_BMC_FIRMWARE_REVISION_HELP #language en-US "Displays BMC Firmware Revision"
#string STR_IPMI_BMC_FIRMWARE_REVISION      #language en-US "BMC Firmware Revision"
#string STR_IPMI_BMC_FIRMWARE_REVISION_VAL  #language en-US "Unknown"

#string STR_IPMI_VERSION_HELP               #language en-US "Displays IPMI Version"
#string STR_IPMI_VERSION                    #language en-US "IPMI Version"
#string STR_IPMI_VERSION_VAL                #language en-US "Unknown"

#string STR_IPMI_BMC_WARM_RESET_HELP        #language en-US "Press <Enter> to do Warm Reset BMC."
#string STR_IPMI_BMC_WARM_RESET             #language en-US "BMC Warm Reset"


#string STR_BMC_WARM_RESET_INFO             #language en-US "BMC WARM RESET INFO"
#string STR_WARM_RESET_BMC                  #language en-US " Warm Reset BMC? "
#string STR_PROTOCOL_NOT_FOUND              #language en-US " Protocol Not Found!!! "
#string STR_BMC_WARM_RESET_ERROR_INFO       #language en-US "BMC WARM RESET ERROR INFO"
#string STR_BMC_WARM_RESET_FAIL             #language en-US " BMC Warm Reset Fails!!! "
#string STR_BMC_WARM_RESET_DONE             #language en-US " BMC Warm Reset Done Successfully!!! "
#string STR_TIME_ZONE_ERROR_INFO            #language en-US "TIME ZONE ERROR INFO"
#string STR_INVALID_TIME_ZONE               #language en-US "Invalid Time zone Entered!!!"

#string STR_IPMI_FUNCTION_SUPPORT           #language en-US "IPMI Function Support"
                                            #language x-AMI "SMCBL0F2" //SMCPKG_SUPPORT
#string STR_IPMI_FUNCTION_SUPPORT_HELP      #language en-US "Enable/Disable IPMI function support"
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**         5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093     **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
